app/views/posts/_post.html.erb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
	<% if current_user.likes.exists?(post_id:@post.id)
	<%= button_to "<%= post.likes.count %> Like",{:controller => 'likes', :action => 'create', :user_id => current_user.id, :post_id => @post.id}, {:method => :post} %>