app/views/posts/_post.html.erb

		<li>
			<% unless current_user.likes.exists?(post_id: post.id) %>
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1 AND "likes"."user_id" = $2 LIMIT $3  [["post_id", 1], ["user_id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."post_id" = $2 LIMIT $3  [["user_id", 1], ["post_id", 2], ["LIMIT", 1]]

			<% else %>
			  <%= button_to "👎",{:action => 'destroy',
			  	:controller => 'likes',:id => post.likes.find_by(user_id:current_user.id).id },
			  	{:method => :delete, :class => "trans-btn font-red mid-font"} %>
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1 AND "likes"."user_id" = $2 LIMIT $3  [["post_id", 1], ["user_id", 1], ["LIMIT", 1]]

	</li>
			<li class="d-flex align-items-center"><%= post.likes.count %> <%= (post.likes.count) == 1 ? 'Like' : 'Likes'%></li>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 2]]

	<ul class="d-flex">
		<li class="comments-count d-flex align-items-center"><%= post.comments.count %> Comments</li>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]