app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "Hello"], ["user_id", 1], ["post_id", 1], ["created_at", "2020-01-11 18:47:19.805256"], ["updated_at", "2020-01-11 18:47:19.805256"]]
---
  def create
    @comment = current_user.comments.build(comments_params)
    redirect_back(fallback_location: root_path) if @comment.save