app/controllers/likes_controller.rb

INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["post_id", 1], ["created_at", "2020-01-11 11:53:33.331118"], ["updated_at", "2020-01-11 11:53:33.331118"]]
---
	def create
		@like = Like.new(likes_params)
		if @like.save