app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
	def new
	  @post = Post.new
	  @posts = Post.all

INSERT INTO "posts" ("content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "Another One"], ["author_id", 2], ["created_at", "2020-01-10 00:17:41.318308"], ["updated_at", "2020-01-10 00:17:41.318308"]]
---
    def create
        @post = current_user.posts.build(posts_params)
        @post.author = current_user
        if @post.save

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
    def index
       @post = Post.new
       @posts = Post.all

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 2]]
---
    def destroy
    	@post = Post.find(params[:id])
    	@post.destroy

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def post_owner
      @post = Post.find(params[:id])