app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = $1 ORDER BY "posts"."created_at" DESC  [["author_id", 2]]
---
	def show
    @user = User.find(params[:id])
    @post = Post.new
    @posts = Post.where("author_id" => @user.id)